sijupyo = { '갑': ["甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥"],
           '을': ["丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥"],
           '병': ["戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥"],
           '정': ["庚子", "辛丑", "壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥"],
           '무': ["壬子", "癸丑", "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"],
           '기': ["甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥"],
           '경': ["丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥"],
           '신': ["戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥"],
           '임': ["庚子", "辛丑", "壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥"],
           '계': ["壬子", "癸丑", "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"]}

gabjapyo = {'Cheongan': ["갑", "을", "병", "정", "무", "기", "경", "신", "임", "계"],
       'CheonganOhaeng': ["木", "木", "火", "火", "土", "土", "金", "金", "水", "水"],
       'CheonganYangeum': ["+", "-", "+", "-", "+", "-", "+", "-", "+", "-"],
       'Jiji': ["자", "축", "인", "묘", "진", "사", "오", "미", "신", "유", "술", "해"],
       'JijiOhaeng': ["水", "土", "木", "木", "土", "火", "火", "土", "金", "金", "土", "水"],
       'JijiYangeum': ["+", "-", "+", "-", "+", "-", "+", "-", "+", "-", "+", "-"],
       'CheonganHanja': ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"],
       'JijiHanja': ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]}